In [1]:
import pandas as pd

In [3]:
df= pd.read_csv('C:/Users/Atharva/Desktop/final/student_data.csv')

In [4]:
df

     Roll                Name Class  Marks  Age
0        1   Arush Srinivasan    TE     93   20
1        2       Charvi Bajaj    SE     86   22
2        3        Aryan Singh    TE     74   21
3        4  Samridhi Banerjee    TE     93   21
4        5         Komal Nair    TE     73   22
..     ...                ...   ...    ...  ...
145    146        Oorvi Kumar    TE     94   22
146    147    Palak Bhatnagar    BE     80   19
147    148      Garvit Murthy    SE     82   18
148    149      Upasana Mehta    TE     69   23
149    150  Charita Choudhary    TE     78   21

[150 rows x 5 columns]

In [6]:
df.mean(numeric_only=True)

Roll     75.500000
Marks    79.853333
Age      20.706667
dtype: float64

In [8]:
df.median(numeric_only=True)

Roll     75.5
Marks    79.0
Age      21.0
dtype: float64

In [10]:
df.std(numeric_only=True)

Roll     43.445368
Marks     8.794741
Age       1.652928
dtype: float64

In [11]:
df.min()

Roll                  1
Name     Aadya Malhotra
Class                BE
Marks                65
Age                  18
dtype: object

In [12]:
df.max()

Roll              150
Name     Zubin Pillai
Class              TE
Marks              95
Age                23
dtype: object

In [13]:
import numpy as np

In [14]:
np.std(df['Marks'])

np.float64(8.765376330895453)

In [15]:
gr1 = df.groupby('Class')

In [16]:
te = gr1.get_group('TE')

In [17]:
te.min()

Roll                  1
Name     Aadya Malhotra
Class                TE
Marks                65
Age                  18
dtype: object

In [18]:
te.max()

Roll              150
Name     Zubin Pillai
Class              TE
Marks              95
Age                23
dtype: object

In [19]:
gr2 = df.groupby('Age')

In [20]:
gr2.groups

{18: [6, 11, 14, 16, 32, 43, 47, 62, 67, 68, 79, 84, 95, 96, 99, 105, 109, 120, 126, 140, 142, 147], 19: [5, 8, 22, 36, 37, 41, 48, 50, 53, 54, 81, 92, 93, 110, 125, 132, 137, 138, 146], 20: [0, 10, 21, 25, 26, 31, 39, 46, 55, 57, 59, 69, 71, 72, 86, 118, 127, 136, 144], 21: [2, 3, 9, 12, 15, 19, 23, 24, 28, 29, 30, 33, 40, 42, 52, 63, 65, 70, 73, 75, 76, 77, 82, 88, 94, 98, 102, 106, 107, 111, 113, 115, 134, 143, 149], 22: [1, 4, 18, 20, 35, 38, 44, 56, 58, 60, 64, 66, 74, 85, 87, 89, 90, 97, 101, 103, 104, 114, 116, 117, 119, 121, 124, 130, 131, 139, 145], 23: [7, 13, 17, 27, 34, 45, 49, 51, 61, 78, 80, 83, 91, 100, 108, 112, 122, 123, 128, 129, 133, 135, 141, 148]}

In [21]:
tw = gr2.get_group(20)

In [22]:
tw

     Roll               Name Class  Marks  Age
0        1  Arush Srinivasan    TE     93   20
10      11       Aryan Singh    SE     79   20
21      22  Rohan Chatterjee    SE     70   20
25      26  Vihaan Choudhary    TE     76   20
26      27    Kaveesh Pandit    SE     67   20
31      32     Jashwin Desai    TE     88   20
39      40     Garima Khanna    TE     82   20
46      47        Naman Iyer    TE     84   20
55      56     Aarushi Bajaj    BE     68   20
57      58      Ishaan Reddy    BE     76   20
59      60        Komal Nair    SE     92   20
69      70        Tanvi Nair    SE     77   20
71      72      Yuvika Menon    BE     87   20
72      73        Dev Sharma    BE     69   20
86      87     Esha Banerjee    BE     91   20
118    119      Madhav Reddy    BE     69   20
127    128   Gitanjali Patel    SE     74   20
136    137        Advik Nair    SE     81   20
144    145        Eshika Rao    BE     87   20

In [25]:
import seaborn as sns

In [26]:
df = sns.load_dataset('iris')

In [27]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [29]:
df.shape

(150, 5)

In [31]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000